[
  {
    "Course No": "ECON F 355",
    "Course Title": "BUSINESS ANALYSIS AND VALUATION",
    "Instructor-in-charge": "Prof. Aprajita Pandey",
    "Description and Scope": "This course focuses on the essential tools and frameworks for evaluating the value of companies through financial analysis. Students will explore key concepts such as internal growth, mergers and acquisitions, along with valuation methodologies like discounted cash flow and relative valuation. Designed for those with prior knowledge in finance and accounting, the course equips students with the skills to analyze financial statements, assess market conditions, and identify key performance drivers. Ideal for aspiring professionals in investment banking, corporate finance, and consulting, this course enhances analytical capabilities and strategic thinking in business valuation and decision-making.\n\nThe Process of measuring and managing the value of companies is a central aspect of financial analysis. Globally, managers are in pursuit of adding value to their firms via two important means. One, by enhancing the firm’s productive capacity through internal (or organic) growth, which has a simultaneous positive impact on its stock price. Second, through mergers and acquisitions (a decision involving factors external to the firm) that interlocks with corporation’s key strengths, and yield benefits in the long run. Hence, asking, “What is something worth?” is avital question to business decision making, and the principal objective behind this course is to provide the learners with the conceptual basis, intuitive reasoning, and analytical framework to answer this question. The focus of this course is on valuing equity (or ownership) in a firm and estimating the value of the overall enterprise. The coverage relies on discounted cash flow, relative valuation, and contingent valuation approaches for extracting the value of a business. Since financial statements serve as the basis for all types of valuation methods, the course begins by providing brief framework on the principles governing the financial statements, and adjustments that are often required to capture the underlying business reality. Students who are either currently pursuing or would like to embark on a career in investment banking, corporate finance, venture capital, entrepreneurship, or business consulting will find the course material to be most useful. The course also carries a broader appeal to individuals who are interested in enhancing their understanding of financial analysis, and in learning how businesses measure and create value for their investors. Important: This is not a beginning level course. The course presumes that you have a prior exposure on a variety of introductory concepts in finance, accounting, and statistics. For beginners, it is therefore highly recommended that they go through the introductory material in finance and accounting concepts at the earliest. Feel free to contact the I/C ASAP in case you are facing difficulty in following the classroom discussions."
  },
  {
    "Course No": "ECON F 313",
    "Course Title": "ISSUES IN ECONOMIC DEVELOPMENT",
    "Instructor-in-charge": "Prof. BALAKRUSHNA PADHI",
    "Description and Scope": "This course provides a com prehensive and contemporary introduction to the economic analysis of development, integrating theory, empirical evidence, and policy analysis. It explores the multifaceted nature of economic development, focusing on core issues such as income and growth, s tructural underdevelopment, poverty, inequality, population dynamics, migration, urbanization, human capital, health, and environmental sustainability. Students will examine critical questions , including: Why do some countries remain poor while others achi eve sustained growth? How do institutions, market imperfections, and public policy influence development outcomes? Drawing on modern development theories and real -world case studies , particularly from India and other developing economies, the course emphas izes the role of infrastructure, foreign investment, international trade, and the Human Development Index (HDI) in shaping development trajectories. Special attention is given to sustainable development and inclusive growth. Through a combination of analyt ical tools, empirical labs, policy debates, and academic readings, students will gain the skills needed to critically assess development strategies and conduct applied research on pressing global development challenges. This course is designed to provide students with a complete understanding of the foundations and evolving dimensions of economic development, focusing on how economic policy can foster both material progress and human well -being. It delves into the co mplexities of development economics, examining the intersection of economic growth with structural transformation, institutional dynamics, and global integration. Key objectives include analyzing the unique characteristics and challenges of developing coun tries, exploring classical and contemporary development theories and their policy implications, and evaluating various growth and development strategies across different national contexts. The course also addresses critical issues such as dualism, structur al change, inequality, poverty, multidimensional poverty, migration, education, health, agriculture, technological progress, environmental sustainability, and the role of institutions. Additionally, it aims to build students’ analytical skills for applying development concepts to real-world problems and prepare them for empirical research in development economics."
  },
  {
    "Course No": "ECON F 412 / FIN F 313",
    "Course Title": "Security Analysis and Portfolio Management",
    "Instructor-in-charge": "Prof. Arya Kumar",
    "Description and Scope": "Introduce students to financial securities analysis and undertake investment decisions. The focus of the course is to give an insight into the evaluation and analysis of a wide range of financial securities, thereby developing techniques for designing an optimal portfolio. The objectives of the course are to provide an introduction to: • Types of financial securities and their salient characteristics • Investment philosophy and its role in asset allocation and long-term personal finance management • Modern portfolio theories and their applications in portfolio design and evaluation • Fundamental and technical analysis of financial instruments • Financial derivative contracts and their applications"
  },
  {
    "Course No": "MPBA G507",
    "Course Title": "Programming for Analytics",
    "Instructor-in-charge": "Prof. Daitri Tiwary",
    "Description and Scope": "Course Objectives:\n1. To develop proficiency in programming to automate analytical workflows, including data cleaning, transformation, and report generation, reducing manual effort and increasing accuracy.\n2. To gain hands-on experience with programming tools and libraries (e.g., Python’s pandas, R’s tidyverse) to efficiently process, manipulate, and analyze large and complex datasets beyond the capabilities of traditional tools.\n3. To design and implement dynamic and interactive data visualizations using programming libraries (e.g., Matplotlib, Seaborn, ggplot2) to uncover trends and communicate insights effectively.\n4. To apply programming best practices to ensure reproducibility, transparency, and scalability of analytical processes, enabling consistent validation and collaboration across teams.\n5. To leverage programming to customize solutions, integrate diverse data sources, and build flexible, end-to-end data pipelines that support advanced business analytics and decision-making.\n\nModule. I R-Programming\nThis module will focus upon:\n1. Visualize and communicate data effectively using ggplot2, by creating layered, aesthetically mapped, and time-series plots, while understanding key graphical elements like geoms, stats, and position adjustments.\n2. Transform, tidy, and manage data efficiently using the dplyr package and tidyverse principles, mastering data reshaping (pivoting), filtering, summarizing, and the use of pipes for streamlined workflows.\n3. Develop robust R coding practices by applying tidyverse code style, organizing projects with scripts and RStudio tools, importing data from various formats, and working with well-structured data frames.\n4. Create and use custom functions with formal and named arguments, implement apply-family functions (lapply, sapply), and handle missing data logically using R’s NA-handling strategies.\n5. Generate and export reproducible reports in formats like Word and PDF using Quarto, with the ability to print results and write outputs to files for seamless reporting and documentation.\n\nPython -Programming – Data Structure & Python Libraries (Numpy, Pandas, Matplotlib & Seaborn)\nLearning Data Structure & Python Libraries (Numpy, Pandas, Matplotlib & Seaborn) is crucial for data analysis in Python for several important reasons:\n1. Python's built-in data structures, such as arrays, tuples, and dictionaries, provide various ways to organize and store data. Learning these data structures helps you choose the most appropriate one for a given task, leading to better code organization and readability.\n2. NumPy's efficient array operations and memory management capabilities significantly enhance the performance of numerical computations. Understanding arrays and their operations allows you to write optimized code that performs faster and and uses less memory.\n3. Pandas provides powerful tools for data manipulation and analysis, while NumPy offers support for large, multi-dimensional arrays and matrices. Pandas and NumPy excel at data manipulation and cleaning, essential steps in any data analysis workflow. These libraries provide functions for handling missing data, merging datasets, and reshaping data, making the data preparation process more manageable.\n4. Matplotlib and Seaborn are essential for creating a wide range of data visualizations, from simple plots to complex graphs. These libraries help you visually rep"
  },
  {
    "Course No": "ECON F312",
    "Course Title": "Money, Banking and Financial Markets",
    "Instructor-in-charge": "ARUN KUMAR GIRI",
    "Description and Scope": "Course Description: Money and its functions; money market; foreign exchange market; financial market; financial derivatives; the banking firm; non-banking financial institutions; Indian banking; monetary transmission mechanisms; money and inflation; central banking; determinants of money supply; tools, goals and targets of monetary policy; international monetary and financial system. Scope & Objective of the Course: To study the mechanisms of debt market and role played by interest rate To study the dynamics and money market and stock market To explore the structure of financial system and understand the reasons financial crisis To understand the role of central banks and commercial banks in regulation money supply in the economy. To discuss the role of central banks in the conduct of monetary policy To study the foreign exchange rate dynamics and foreign exchange risk To discuss the risk management techniques for financial institutions."
  },
  {
    "Course No": "MPBA G507",
    "Course Title": "Programming For Analytics",
    "Instructor-in-charge": "Prof. Achint Nigam",
    "Description and Scope": "Learning programming is essential for analytics for several compelling reasons:\n\n1. Programming allows analysts to automate repetitive tasks, saving time and reducing the potential for human \nerror. This automation can include data cleaning, data transformation, and report generation. Languages like \nPython and R provide powerful libraries and tools to streamline these processes.  \n2. As data grows in volume, traditional tools like spreadsheets become insufficient. Programming languages are \ndesigned to handle and process large datasets efficiently. For example, Python’s pandas library and R’s tidyverse \npackage enable analysts to work with large datasets seamlessly. \n3. Effective data visualization is crucial for communicating insights. Programming languages offer extensive \nlibraries for creating a wide range of visualizations. Python’s Matplotlib, Seaborn, and Plotly, along with R’s \nggplot2, allow for the creation of dynamic and interactive visualizations that can uncover hidden patterns and \ntrends. \n4. Programming ensures that analyses are reproducible. Scripts can be shared, reviewed, and rerun by others, \nensuring that the results are consistent and verifiable.  \n5. Programming provides the flexibility to tailor solutions to specific problems. Analysts are not limited by the \nfunctionalities of pre-built software; they can write custom scripts to address unique challenges. This \ncustomization is particularly valuable in analytics, where different datasets and business questions require \nunique approaches. \n6. Programming skills enable analysts to integrate various tools and technologies. For example, they can connect \ndatabases, web APIs, and other data sources directly into their analysis workflows. This integration capability \nis essential for building comprehensive data pipelines and ensuring smooth data flow across systems. \n7. Proficiency in programming is a highly sought-after skill in the job market. It opens up numerous career \nopportunities in data science, business intelligence, and analytics. Professionals who can combine domain \nknowledge with programming skills are in high demand, as they can effectively turn data into actionable \ninsights. \n8. In the age of big data, the ability to program is a critical skill for analysts. It enhances efficiency, enables \nadvanced analysis, ensures reproducibility, offers customization, and integrates with various tools. Ultimately, \nlearning programming equips analysts with the tools to extract meaningful insights from data, driving better \ndecision-making and business outcomes. \n\nR-Programming - Tidyverse \nLearning Tidyverse is crucial for data analysis in R for several important reasons:\n\n1. The Tidyverse suite includes packages like dplyr, tidyr, and readr, which simplify data manipulation tasks. With \nintuitive and consistent syntax, these packages allow for efficient data cleaning, transformation, and \nsummarization. This streamlined approach significantly reduces the time and effort required to prepare data for \nanalysis. \n2. The Tidyverse adopts a consistent and readable syntax across its packages. This consistency makes it easier for \nusers to learn and apply different functions within the Tidyverse ecosystem. The use of a consistent grammar, \nsuch as the \"pipe\" operator (`|>`), enhances readability and makes code more intuitive and easier to debug. \n3. One of the standout packages in the Tidyverse is ggplot2, a powe"
  },
  {
    "Course No": "MPBA G502",
    "Course Title": "Financial Statement Analysis and Reporting",
    "Instructor-in-charge": "Prof. Saurabh Chadha",
    "Description and Scope": "The common thread running through all the decisions taken by various managers is money and there is hardly any manager working in any organisation to whom money does not matter. This course has been designed keeping the above fundamental business concepts in mind. Efforts will be made to appreciate the basic understanding of accounting concepts, practices, preparation and analysis of financial statements using spreadsheet modelling. Develop conceptual knowledge of the financial accounting and about the techniques for preparing accounts in different business organizations. Understand the accounting process and to develop skills necessary to evaluate an enterprise’s financial position and its operating, investing and financing activities. Develop the skills needed to analyze financial statements effectively. Gain an understanding of the choices enterprises make in reporting the results of their business activities."
  },
  {
    "Course No": "MPBA G517",
    "Course Title": "Big Data Analytics",
    "Instructor-in-charge": "Praveen Goyal",
    "Description and Scope": "The course imparts skills on big data in analytics using Apache Spark. At the end of the course, students are expected to apply concepts of big data and big data architecture on huge volumes of real time data, and develop product or solutions development. Apache Spark is the tool taught for handling the concepts of big data. All the illustrations are done on native Spartk, and with Python API for Spark i.e., PySpark. Students may use R Spark API for submission of assignments."
  },
  {
    "Course No": "MPBA G521",
    "Course Title": "Analytics for Supply Chain",
    "Instructor-in-charge": "Dr Satyendra Kumar Sharma",
    "Description and Scope": "Supply chain performance, Descriptive analytics, Supply chain forecasting, studying holt, winter and ARIMA models, Supply chain segmentation. Single period and multi -period inventory modeling, Multi -echelon inventory models, Network flow models, Distribution planning, Sales, & Operations planning, Vehicle routing problems, Simulation in supply chain risk assessment Supply chain analytics is amalgamation of supply chain management and data analytics. In this course you would be given basics and tool/techniques of data analytics with the domain of SCM. Students will be exposed to fundamental theories in business practice, and limitations and difficulties of supply chain management theories in solving real problems. The basic objective of this course is to help students develop the skill found in competent supply chain manager as well as analyst."
  },
  {
    "Course No": "ECON F354 / FIN F311",
    "Course Title": "Derivatives & Risk Management",
    "Instructor-in-charge": "Prof. Aditya Sharma",
    "Description and Scope": "The objective of this course is to provide students an introductory level familiarity with a particular type of financial instruments known as DERIVATIVES. To achieve the stated objectives, the course provides a detailed description on the structure (read, design) and utility (read, relevance) of the most common and popular financial derivatives namely, Options, Futures, and Swaps. The scope of the course entails acquainting students with the mechanics of trading and settlement of derivative instruments in the financial markets and their function as insurance products for hedging financial risk. No understanding about financial instruments or their derivatives is complete without a thorough grasp over interest rate concepts and hence the course also includes discussion on topics such as time value of money, term structure of interest rates and their role in valuation of bonds, computation of yield and forward interest rates, estimating bond-price volatility, and the role of bond duration and convexity in mitigating interest rate risks. The topics covered in the course will, at an introductory level, enable participants to learn about common risks prevalent in the financial markets and how to manage its impact on investment exposure by using derivatives. Discussion on valuation of financial derivatives and a brief introduction to creating synthetic investment positions by combining derivatives prepares students for advanced level courses such as Financial Engineering and Financial Risk Analytics and Management. The course concludes with a survey of selective topics of contemporary interest to risk management industry such as forecasting volatility, estimating value-at-risk, etc. The topics covered in the course will also assist students in preparing for competitive professional international certifications such as Financial Risk Manager (FRM) and Chartered Financial Analyst (CFA)."
  },
  {
    "Course No": "MPBA G530",
    "Course Title": "Financial Analytics",
    "Instructor-in-charge": "Mr. PABITRA BISWAS",
    "Description and Scope": "The course introduces students to the applications of different techniques of Statistics, Analytics, and machine learning to solve financial problems. The students will be exposed to understanding the characteristics of financial data, solving univariate and multivariate time series based forecasting problems for prices and returns, problems on portfolio allocation, rebalancing and optimization, Security performance analytics, trading strategies, Application of clustering and text mining in financial problem solving. The course will be a practical hands-on course which would be delivered in excel/ Python. This course aims at discussing the role of data and analytics in financial decision making, understanding the statistical properties of financial data. The student should be able to price different securities by understanding their characteristics and using different statistical and machine learning techniques. The student should also be able to create optimal portfolios catering to the requirements of different user groups and evaluate the portfolios using different metrics. The course also aims to discuss some of the most prominent applications of Analytics in Finance like Credit Scoring, Debt collection, Sentiment Analysis, Trading strategies"
  },
  {
    "Course No": "BITS F482/C482/MBA C482",
    "Course Title": "Creating and Leading Entrepreneurial Organization",
    "Instructor-in-charge": "ARYA KUMAR",
    "Description and Scope": "Fundamentals of Entrepreneurship; Elements of Leadership; Identifying Business Opportunities; Market Study and Research; Business Plans; Finance, Issues in Raising Finance, Venture Capitalist Evaluation of Busines s Plans, Technical Aspects for the Project; Corporate Strategies for Growth; Legal Aspects to entrepreneurship; People Skills; Marketing and Branding; Creativity and Communication. This Course is about creating, managing, and leading an organization. This course helps in creating an entrepreneurial mindset, developing entrepreneurial skills and equipping students with the basic knowledge necessary for an entrepreneur ."
  },
  {
    "Course No": "MPBA G514",
    "Course Title": "Deep Learning for Business",
    "Instructor-in-charge": "Prof. Abhishek Verma",
    "Description and Scope": "This course offers an introduction to deep learning and its practical relevance in business contexts. It covers foundational concepts such as neural networks, linear and logistic regression using neural architectures, deep neural networks, hyperparameter tuning, and advanced models like CNNs, RNNs, LSTMs, GANs, and deep reinforcement learning. The course blends theoretical understanding with hands -on applications to solve real -world business problems. It also highlights the challenges and limitations of deep learning methods in practice. The course aims to equip students with foundational and practical knowledge of deep learning algorithms and their applications in solving business challenges. The course emphasizes: a. Understanding core deep learning architectures and techniques b. Translating business problems into machine learning tasks c. Developing, training, and tuning deep learning models using appropriate tools d. Applying deep learning to solve business challenges e. Utilizing TensorFlow and Keras libraries on Google Colab to implement and explore deep learning algorithms f. Recognizing the limitations, ethical concerns, and interpretability issues of deep models in business decision -making g. Engaging in a group -based project , where students apply deep learning techniques to some real -world business problems"
  },
  {
    "Course No": "MPBA G532",
    "Course Title": "Financial Modelling and Valuation",
    "Instructor-in-charge": "Prof. Saurabh Chadha (Dept. of Management)",
    "Description and Scope": "A key component of financial management is the act of calculating and managing a company's value. In essence, managers work to increase the value of their companies in two ways: by increasing the firm's productivity through internal (or organic) growth and by making wise acquisitions that play to the company's core competencies. It follows that practically every significant business choice is decided by asking, \"What is it worth?\" This course's main goal is to arm you with the conceptual foundation, logical framework, and intuitive reasoning needed to make thoughtful decisions on company value.\nThis course's emphasis is on asses ing the value of the entire enterprise and valuing stock in a company. For our study, we'll depend on the income and market approaches of financial valuation. The course begins by presenting a brief framework on the rules regulating financial statements and changes that are frequently needed to capture the underlying company reality because financial statements serve as the foundation for all types of valuation methodologies. We will use spreadsheet for building the financial model of a company.\nThis course will be most helpful to students who are either pursuing a career in investment banking, corporate finance, venture capital, entrepreneurship, or business consulting or who would like to do so. The course also has a broader appeal to people who want to improve their knowledge of financial analysis and discover how companies produce and quantify value for their investors."
  },
  {
    "Course No": "MPBA G531",
    "Course Title": "FINANCIAL DERIVATIVES AND ANALYSIS",
    "Instructor-in-charge": "UDAYAN CHANDA",
    "Description and Scope": "The course will provide knowledge about a preliminary understanding of standard financial derivatives – e.g., forwards, futures, swaps, and options. The main objective of this course is to help students gain intuition and to provide the necessary skills for pricing and hedging derivative securities, enabling students to respond to the professional requirements particularly related to investment, risk management, prediction purposes, etc.\n\nCourse Plan Topics: Introduction to fixed income securities. Concept of interest rates & term structure. Bonds basics and dynamics of bond price, Duration & Modified Duration, yield -maturity -price relationship. Bond convexity trades and sources of convexity. Basics of derivatives. Determination of Forwards and Futures prices, Basics of Futures, forwards, options & swaps, and their pay -off. Hedging Strategies using Futures, synthetic. Swaps, types & mechanics of swap. Framework for swaps, term structure modeling, and dynamics. Wiener process and Ito’s Lemma. The Markov property, continuous time stochastic processes, the process for a stock price, the parameters, correlated processes, Ito’s lemma, the lognormal property. Options Pricing, Option mechanics, options engineering and its application. Valuation of Options, Options pricing using Black -Scholes and Binomial model. Greeks and their uses. Options strategies. Volatility swaps, Smiles, and volatility trading. Volatility positions, smile effects. Estimating volatilities and correlations. Estimating volatility, the exponential weighted moving average model, the GARCH (1,1) model, choosing between the models, maximum likelihood methods, using GARCH (1,1) to forecast future volatility."
  },
  {
    "Course No": "MPBA G521",
    "Course Title": "Analytics for Supply Chain",
    "Instructor-in-charge": "Dr Satyendra Kumar Sharma",
    "Description and Scope": "Supply chain performance, Descriptive analytics, Supply chain forecasting, studying holt, winter and ARIMA models, Supply chain segmentation. Single period and multi -period inventory modeling, Multi -echelon inventory models, Network flow models, Distribution planning, Sales, & Operations planning, Vehicle routing problems, Simulation in supply chain risk assessment Supply chain analytics is amalgamation of supply chain management and data analytics. In this course you would be given basics and tool/techniques of data analytics with the domain of SCM. Students will be exposed to fundamental theories in business practice, and limitations and difficulties of supply chain management theories in solving real problems. The basic objective of this course is to help students develop the skill found in competent supply chain manager as well as analyst."
  },
  {
    "Course No": "MPBAG529",
    "Course Title": "Marketing Research & Metrics",
    "Instructor-in-charge": "ANILBHAT",
    "Description and Scope": "All organizations need to research their markets periodically and employ various elements of marketing research process viz. problem definition, development of an approach to the problem, research design formulation, fieldwork & data collection, data preparation & analysis and finally report preparationand presentation.\nThe emphasis of the course is proportionately focused on foundational concepts, methodology & techniques,andmarketingresearchapplications.Anumberofcaseswillbeassignedfordiscussion in the class. The course pedagogy lays special emphasis on “ learning by doing ” and a project assignmentinthis course characterizesthisorientation.\nToimpartnecessaryfoundationalconcepts,methodologiesandtools/techniquesforroleof a market researcher. That role envisages generation of actionable, reliable and accurate i n f o r m a t i o n to identify various marketing problems viz. demand forecasting, segmentation, targeting, positioning, new product development etc. and find their effectivesolutions."
  },
  {
    "Course No": "MPBA G506",
    "Course Title": "Data Management & Warehousing (DMW)",
    "Instructor-in-charge": "Prof. Abhishek Verma",
    "Description and Scope": "This course introduces students to the practical usage of databases, emphasizing SQL. As big data problems become more prevalent for businesses, this module introduces the basics of databases. After successful completion of the course, students will be able to learn why database management is essential, analyze the data requirements of a business scenario and represent these requirements utilizing entity -relationship (ER) diagrams, translate an ER diagram into normalized tables for a relational database management system, and write simple and relatively complex data retrieval queries. Students will learn how to extract valuable insights from databases through data analytics powered by SQL. The course covers various Database Management and Data Warehousing concepts and enhances learning effectiveness through developing scripting skills. It aims to provide students with the necessary knowledge and skills to understand the data infrastructure underpinning business intelligence and analytics. Students undertaking this course should be able to appreciate the complexities involved in Database management and be prepared to solve the issues a business analyst faces."
  },
  {
    "Course No": "MPBA G506",
    "Course Title": "Data Management & Warehousing (DMW)",
    "Instructor-in-charge": "Prof. Satanik Mitra",
    "Description and Scope": "This course introduces students to the practical usage of databases, emphasizing SQL. As big data problems become more prevalent for businesses, this module introduces the basics of databases. After successful completion of the course, students will be able to learn why database management is essential, analyze t he data requirements of a business scenario and represent these requirements utilizing entity -relationship (ER) diagrams, translate an ER diagram into normalized tables for a relational database management system, and write simple and relatively complex da ta retrieval queries. Students will learn how to extract valuable insights from databases through data analytics powered by SQL. The course covers various Database Management and Data Warehousing concepts and enhances learning effecti veness through developing scripting skills. It aims to provide students with the necessary knowledge and skills to understand the data infrastructure underpinning business intelligence and analytics. Students undertaking this course should be able to appreciate the complexities involved in Database management and be prepared to solve the issues a business analyst faces."
  },
  {
    "Course No": "MPBA G505",
    "Course Title": "Statistics & Basic Econometrics",
    "Instructor-in-charge": "Dr. Achint Nigam",
    "Description and Scope": "This course is an introduction to statistical analysis and basic econometrics, in which the tools of economic theory, mathematics, and statistical inference are applied to the analysis of business phenomena. The course reviews probability distributions, statistical inference, estimation, and hypothesis testing; ANOVA, ANCOVA, and then introduces multiple regression analysis, which remains the most commonly used statistical technique in econometrics. The remainder of the course considers various practical aspects of linear regression models and includes dummy variables, different functional forms, and the consequences of violation of the classical regression assumptions. Students will study and apply regression analysis to various data sets to familiarize students with the core concepts of estimation of economic parameters, prediction of business outcomes, and statistical inference.\n \nA two-hour lab will be conducted every week (along with MPBAG507). Students will learn how to explore and analyze different types of economic data using Microsoft Excel / R programming. Students will learn important skills of advanced statistical and econometric analysis with applications in Microsoft Excel / R programming. By the end of this course, students should be able to:\n Use of statistical and econometric analysis model, to estimate relevant business parameters, predict economic outcomes, and test economic hypotheses using quantitative data.  \n Appreciate the basic assumptions of the classical linear regression model, and identify and resolve any violations of these assumptions, such as autocorrelation and heteroscedasticity.  \n Develop and maintain a working knowledge of econometrics that will provide a basic foundation for future study in business analytics and statistical techniques"
  },
  {
    "Course No": "MPBA G515",
    "Course Title": "PRESCRIPTIVE ANALYTICS WITH MATHEMATICAL PROGRAMMING",
    "Instructor-in-charge": "PROF RAJESH MATAI",
    "Description and Scope": "Prescriptive analytics is the third and final phase of business analytics, which also includes descriptive and predictive analytics. Referred to as the \"final frontier of analytic capabilities\", prescriptive analytics entails the application of mathematical and computational sciences and suggests decision options for how to take advantage of the results of descriptive and predictive phases. The first stage of business analytics is descriptive analytics, which still accounts for the majority of all business analytics today. Descriptive analytics looks at past performance and understands that performance by mining historical data to look for the reasons behind past success or failure. Most management reporting – such as sales, marketing, operations, and finance – uses this type of post-mortem analysis. The next phase is predictive analytics. Predictive analytics answers the question of what is likely to happen in future. This is where historical data is combined with rules, algorithms, and occasionally external data to determine the probable future outcome of an event or the likelihood of a situation occurring. The final phase is prescriptive analytics, which goes beyond predicting future outcomes but also suggests actions to benefit from the predictions and shows the implications of each decision option. While the term prescriptive analytics was first coined by IBM and was later trademarked by Texas-based company Ayata, the underlying concepts have been around for hundreds of years in the form of Operations Research. Prescriptive Analytics has been considered as the next step towards increasing data analytics maturity and leading to optimized decision making, ahead of time, for business performance improvement. New Information and Communication Technologies (ICT) such as the Internet of Things (IoT), real-time streaming and sensor-driven business operations have bolstered prescriptive analytics and have provided businesses with accurate prescriptions facilitating reliable and effective decision making. Prescriptive analytics assists the decision maker to identify the best action (optimal solution), given the problem context. The difference between decisions arrived using descriptive/predictive analytics and prescriptive analytics is that a prescriptive analytics algorithm tries to arrive at the best decision (optimal solution) based on an objective function (sometimes more than one objective function) and a list of constraints. Prescriptive analytics models attempt to solve complex optimization problems of the modern era. Students will be exposed to a very powerful optimization software, Lingo, so that they can formulate and solve real-life Prescriptive Analytics problems. Students can download a trial version (free) of Lingo from https://www.lindo.com/index.php/products/lingo-and-optimization-modeling Using Lingo, large-sized complex Prescriptive Analytics problems can be solved."
  },
  {
    "Course No": "MPBA 523",
    "Course Title": "IT PROJECT MANAGEMENT",
    "Instructor-in-charge": "Not Available",
    "Description and Scope": "Understanding project management, organizing and staffing the project office team, planning, project evaluation, cost control and trade off analysis in a project environment. Essentials of Project Management are an introductory course on issues related to the project management of enterprises with emphasis on planning, scheduling and controlling. Students will be exposed to fundamental theories in business practice, and limitations and difficulties of project management theories in solving real problems. The basic objective of this course is to help students develop the skill found in competent project manager."
  },
  {
    "Course No": "ECON F311",
    "Course Title": "International Economics",
    "Instructor-in-charge": "Prof. GEETILAXMI MOHAPATRA",
    "Description and Scope": "This course develops a systematic exposition of both classical and modern theories of international trade in goods and services that try to explain the composition, direction, and consequences of international trade, and the determinants and effects of trade policy. The course will look critically at the welfare and profit implications of trade policy deviations from free trade. It then builds on the models of open economy macroeconomics. \n\nScope and objective of the course:\n To understand the effects of international trade on individuals and businesses  \n To understand the effects of changes in trade policies on trade  \n To apply macroeconomic models to understand the international economy.  \n To focus on the interrelationships among aggregate economic variables such as GDP, unemployment rates, inflation rates, trade balances, exchange rates, interest rates, etc.  \n To focus on the significance of trade imbalances, the determinants of exchange rates, and the aggregate effects of government monetary and fiscal policies."
  },
  {
    "Course No": "MPBA G501",
    "Course Title": "Managerial Economics",
    "Instructor-in-charge": "Leela Rani",
    "Description and Scope": "The course provides to the students: 1. An insight into the scientific & analytical methods, techniques and tools of economics 2. A precise and comprehensive coverage of fundamental concepts in economics 3. Suitable real world applications & examples to expose him /her to possibilities of implementing concepts in business and economic practices and polic es 4. Approach to integrate different aspects of a firm’s economic decisions within the firm’s framework as well as find & understa nd connections with the macroeconomic environment. This course aims at providing an overview of comprehensive coverage of fundamental concepts, analytical tools understanding economics of business decision making for a profitable and sustainable status in dynamic business environment . While the primary unit of analysis is firm, t he coverage of this course would enable finding & understanding connections of firms’ decisions with its industry and the macroeconomic environment at large."
  },
  {
    "Course No": "MPBA G526",
    "Course Title": "Pricing Analytics",
    "Instructor-in-charge": "Praveen Goyal",
    "Description and Scope": "This course provides an introduction to both the theory and the practice of revenue management and pricing , Fundamentals of price theory, Segmentation and price differentiation, Break - even analysis, Price sensitivity and willingness -to-pay, Empirical estimations of price -response functions, Price optimization, Markdown optimization, The hedonic pricing model, Revenue Management, Monte Carlo simulation for pricing decisions, Conjoint analysis for pricing decisions. The objectives of this course are: (1) To make you acquainted with the concept of pricing and how data can help in setting the right price for the organization. This will be done primarily through lectures, class discussions and assigned readings."
  },
  {
    "Course No": "MPBA G 524",
    "Course Title": "MARKETING ANALYTICS",
    "Instructor-in-charge": "Dr. Achint Nigam",
    "Description and Scope": "Today, companies heavily rely on data -driven marketing to better understand the needs of their customers. Th ey gather data on purchase behavior, social relationships, or attitudes through various data collection method s. By analyzing such data, firms gain market insights and can enhance marketing decisions such as segmentation and targeting of customers, positioning of products based on customer preferences, or developing the right marketing mix. However, many marke ters lack knowledge on how data can be collected and how basic research techniques can be applied to analyze it. To prepare managers of tomorrow , this course will cover pricing tactics, forecasting of existing and new products, customer want, calculating customer value, segmenting the market, market basket analysis , and advanced marketing research tools like PCA, MDS, and classification algorithms. We will use both Microsoft Excel to cover basic topics and R programming language for advanced topics. The approach will be practical, and the focus will be on hands -on learning in each session."
  },
  {
    "Course No": "MPBA G503",
    "Course Title": "Marketing",
    "Instructor-in-charge": "ANIL BHAT",
    "Description and Scope": "This basic course in marketing is designed to familiarize students with the strategic and tactical decision making process in marketing that deals with the fundamental goal of creating, communicating and delivering value to the customer. This requires a professional knowledge of market drivers, competitors’ capabilities, technological trends and the market dynamics of value. The focus will be on the imbibing the skills of uncovering market opportunities by asking certain strategic questions. On successful completion of this course, participants will be able to critically analyze and intelligently draw inference about the marketing strategies of organizations. Through an intensive assignment an effort will be made to develop the necessary skills for crafting a typical marketing plan grounded in real world data. Finally, awareness of tools available to marketing managers to facilitate planning and decision-making would be one of the gains from the course. Students are encouraged to bring some of the topical issues of contemporary concern in marketing to the classroom for discussion . Students will also be expected to imbibe path-breaking classic marketing literature in a group setting through group discussions for a sound academic base. A number of journal articles will be discussed in this course to give the course its academic rigor. The course pedagogy lays special emphasis on “learning by doing ” through regular discussion of 6-7 Harvard Business Review cases as well as through a group marketing project assignment."
  },
  {
    "Course No": "MPBA G503",
    "Course Title": "Marketing",
    "Instructor-in-charge": "ANILBHAT",
    "Description and Scope": "This basic course in marketing is designed to familiarize students with the strategic and tactical decision making process in marketing that deals with the fundamental goal of creating, communicating and delivering value to the customer. This requires a professional knowledge of market drivers, competitors’ capabilities, technological trends and the market dynamics of value. The focus will be on the imbibing the skills of uncovering market opportunities by asking certain strategic questions. On successful completion of this course, participants will be able to critically analyze and intelligently draw inference about the marketing strategies of organizations. Through an intensive assignment an effort will be made to develop the necessary skills for crafting a typical marketing plan grounded in real world data. Finally, awareness of tools available to marketing managers to facilitate planning and decision-making would be one of the gains from the course. Students are encouraged to bring some of the topical issues of contemporary concern in marketing to the classroom for discussion .Students will also be expected to imbibe path-breaking classic marketing literature in a group setting through group discussions for a sound academic base. A number of journal articles will be discussed in this course to give the course its academic rigor. The course pedagogy lays special emphasis on “learning by doing ” through regular discussion of 6-7 Harvard Business Review cases as well as through a group marketing project assignment."
  },
  {
    "Course No": "MPBA G502",
    "Course Title": "Financial Statement Analysis and Reporting",
    "Instructor-in-charge": "Prof. Saurabh Chadha",
    "Description and Scope": "The common thread running through all the decisions taken by various managers is money and there is hardly any manager working in any organisation to whom money does not matter. This course has been designed keeping the above fundamental business concepts in mind. Efforts will be made to appreciate the basic understanding of accounting concepts, practices, preparation and analysis of financial statements using spreadsheet modelling. Develop conceptual knowledge of the financial accounting and about the techniques for preparing accounts in different business organizations. Understand the accounting process and to develop skil s neces ary to evaluate an enterprise’s financial position and its operating, investing and financing activities. Develop the skills needed to analyze financial statements effectively. Gain an understanding of the choices enterprises make in reporting the results of their busines activities."
  },
  {
    "Course No": "MPBA G501",
    "Course Title": "Managerial Economics",
    "Instructor-in-charge": "Leela Rani",
    "Description and Scope": "The course provides to the students: 1. An insight into the scientific & analytical methods, techniques and tools of economics 2. A precise and comprehensive coverage of fundamental concepts in economics 3. Suitable real world applications & examples to expose him /her to possibilities of implementing concepts in business and economic practices and polic es 4. Approach to integrate different aspects of a firm’s economic decisions within the firm’s framework as well as find & understa nd connections with the macroeconomic environment. This course aims at providing an overview of comprehensive coverage of fundamental concepts, analytical tools understanding economics of business decision making for a profitable and sustainable status in dynamic business environment . While the primary unit of analysis is firm, t he coverage of this course would enable finding & understanding connections of firms’ decisions with its industry and the macroeconomic environment at large."
  },
  {
    "Course No": "MPBA G505",
    "Course Title": "Statistics & Basic Econometrics",
    "Instructor-in-charge": "Udayan Chanda",
    "Description and Scope": "This course serves as an introductory exploration of statistical analysis and fundamental econometrics, wherein the principles of economic theory, mathematics, and statistical inference are employed to examine business phenomena. The curriculum encompasses a review of probability distributions, statistical inference, estimation, and hypothesis testing. It also covers analysis of variance (ANOVA), analysis of covariance (ANCOVA), and introduces multiple regression analysis, which remains the most widely util ized statistical technique within the field of econometrics. The latter part of the course addresses various practical considerations related to linear regression models, including the use of dummy variables, alternative functional forms, and the implicati ons of violating classical regression assumptions. Students will engage in the study and application of regression analysis to diverse data sets, thereby gaining familiarity with core concepts such as the estimation of economic parameters, forecasting busi ness outcomes, and conducting statistical inference.\n \nA weekly two -hour laboratory session will be conducted, during which students will learn to explore and analyze different types of economic data using R programming. This component aims to develop proficiency in advanced statistical and econometric techniq ues through practical applications in R . By the end of this course, students should be able to:\n• Apply statistical and econometric models to estimate relevant business parameters, predict economic outcomes, and test hypotheses using quantitative data.\n• Understand the fundamental assumptions underlying the classical linear regression model and identify and address potential violations, such as autocorrelation and heteroscedasticity.\n• Develop and sustain a foundational knowledge of econometrics that will serve as a basis for further study in business analytics and advanced statistical methodologies."
  }
]